<?php
$questions = array(
    array(
        "question" => "Материнская плата это:",
        "answer1" => "Многослойная печатная плата, на которой устанавливаются основные компоненты персонального компьютера (центральный процессор, контроллер ОЗУ и собственно ОЗУ, загрузочное ПЗУ, контроллеры базовых интерфейсов ввода-вывода).",
        "answer2" => "Однослойная печатная плата, на которой устанавливаются основные компоненты персонального компьютера (центральный процессор, контроллер ОЗУ и собственно ОЗУ, загрузочное ПЗУ, контроллеры базовых интерфейсов ввода-вывода).",
        "answer3" => "Многослойная печатная плата, на которой устанавливаются основные компоненты персонального компьютера (центральный процессор, контроллер ОЗУ и собственно ОЗУ, загрузочное ПЗУ).",
        "answer4" => "Однослойная печатная плата, на которой устанавливаются основные компоненты персонального компьютера (центральный процессор, контроллер ОЗУ и собственно ОЗУ, загрузочное ПЗУ)."
    ),
    array(
        "question" => "Компьютерная грамотность это:",
        "answer1" => "Владение минимальным набором знаний и навыков работы на компьютере.",
        "answer2" => "Умение без ошибок печатать на компьютере.",
        "answer3" => "Навык быстрого чтения с экрана монитора.",
        "answer4" => "Навык слепой печати."
    ),
    array(
        "question" => "Локальная сеть это:",
        "answer1" => "Компьютерная сеть, покрывающая обычно большую территорию или большую группу зданий.",
        "answer2" => "Цифровая сеть, покрывающая обычно относительно небольшую территорию или небольшую группу зданий.",
        "answer3" => "Компьютерная сеть, покрывающая обычно относительно небольшую территорию или небольшую группу зданий.",
        "answer4" => "Цифровая сеть, покрывающая обычно большую территорию или большую группу зданий."
    ),
    array(
        "question" => "Баг это:",
        "answer1" => "Жучок, используемый спецслужбами для прослушивания.",
        "answer2" => "Ошибка, сбой, дефект (в программе). Означает «недоработку в компьютерной программе, приводящую к нежелательным или неожидаемым действиям, или же вообще не позволяющую её запустить».",
        "answer3" => "Вид компьютерного вируса, который внедряется в систему через электронную почту.",
        "answer4" => "Программа, решающая задачи классификации насекомых."
    ),
    array(
        "question" => "Выберите лишнее:",
        "answer1" => "Microsoft Excel.",
        "answer2" => "Microsoft Access.",
        "answer3" => "Microsoft Publisher.",
        "answer4" => "Microsoft Inlook."
    ),
    array(
        "question" => "Драйвер это:",
        "answer1" => "Программа - навигатор, используемая водителями такси.",
        "answer2" => "Низкоуровневый язык программирования",
        "answer3" => "Программа, которая обеспечивает обмен данными между компьютером и периферийным оборудованием.",
        "answer4" => "Специальная программа (или файл) для взлома программного обеспечения."
    ),
    array(
        "question" => "Куки это:",
        "answer1" => "Некая информация, которая записывается с посещаемого вами сайта на ваш компьютер. ",
        "answer2" => "Средство для решения внезапно возникшей проблемы или устранения ошибки, препятствующих работе компьютера.",
        "answer3" => "Подключаемая программа, выполняющая какие-либо дополнительные функции в главной программе.",
        "answer4" => "Упрощенное графическое изображение, или набор символов, используемых при общении в Интернет."
    ),
    array(
        "question" => "Софт это:",
        "answer1" => "Мягкий коврик для мыши.",
        "answer2" => "Вид клавиатуры, с беcшумными клавишами.",
        "answer3" => "Аппаратная часть системы.",
        "answer4" => "Программное обеспечение."
    ),
    array(
        "question" => "Сервер это:",
        "answer1" => "Специальная служба, компания, предоставляющая место для вашего сайта на своих серверах, как платно, так и бесплатно.",
        "answer2" => "Специализированный компьютер или специализированное оборудование для выполнения на нём сервисного программного обеспечения.",
        "answer3" => "Программа для передачи файлов по протоколу FTP, очень удобна для закачивания файлов на сайт.",
        "answer4" => "Протокол передачи файлов."
    ),
    array(
        "question" => "Социальная инженерия это:",
        "answer1" => "Это метод управления действиями человека без использования технических средств.",
        "answer2" => "Это методы изучения поведения людей в определённых ситуациях.",
        "answer3" => "Программное обеспечение позволяющее отслеживать действия пользователя персонального компьютера.",
        "answer4" => "Инструменты предназначенные для построения, отражения и организации социальных взаимоотношений в Интернете."
    ),
)
?>